coocox/Mplib/Toshaba/TMPM36x/TMPM363/cmsis_lib/lib/include/tmpm363_gpio.h
#define IS_GPIO_PM_PULLUP_BIT(param)     (((param) & GPIO_PM_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PM_PULLUP_BIT_ALL))))

#define IS_GPIO_PM_INPUT_BIT(param)      (((param) & GPIO_PM_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PM_INPUT_BIT_ALL))))

#define IS_GPIO_PN_OUTPUT_BIT(param)     (((param) & GPIO_PN_OUTPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PN_OUTPUT_BIT_ALL))))

#define IS_GPIO_PN_FR1_BIT(param)        (((param) & GPIO_PN_FR1_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PN_FR1_BIT_ALL))))

#define IS_GPIO_PN_FR2_BIT(param)        (((param) & GPIO_PN_FR2_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PN_FR2_BIT_ALL))))

#define IS_GPIO_PN_FR3_BIT(param)        (((param) & GPIO_PN_FR3_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PN_FR3_BIT_ALL))))

#define IS_GPIO_PN_OPEN_DRAIN_BIT(param) (((param) & GPIO_PN_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PN_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PN_PULLUP_BIT(param)     (((param) & GPIO_PN_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PN_PULLUP_BIT_ALL))))

#define IS_GPIO_PN_INPUT_BIT(param)      (((param) & GPIO_PN_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PN_INPUT_BIT_ALL))))

#define IS_GPIO_PP_OUTPUT_BIT(param)     (((param) & GPIO_PP_OUTPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PP_OUTPUT_BIT_ALL))))

#define IS_GPIO_PP_FR1_BIT(param)        (((param) & GPIO_PP_FR1_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PP_FR1_BIT_ALL))))

#define IS_GPIO_PP_FR2_BIT(param)        (((param) & GPIO_PP_FR2_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PP_FR2_BIT_ALL))))

#define IS_GPIO_PP_OPEN_DRAIN_BIT(param) (((param) & GPIO_PP_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PP_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PP_PULLUP_BIT(param)     (((param) & GPIO_PP_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PP_PULLUP_BIT_ALL))))

#define IS_GPIO_PP_INPUT_BIT(param)      (((param) & GPIO_PP_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PP_INPUT_BIT_ALL))))

/** @} */
/* End of group GPIO_Bit_Define */

/** @defgroup GPIO_Exported_FunctionPrototypes
  * @{
  */
    uint8_t GPIO_ReadData(GPIO_Port GPIO_x);
    uint8_t GPIO_ReadDataBit(GPIO_Port GPIO_x, uint8_t Bit_x);
    void GPIO_WriteData(GPIO_Port GPIO_x, uint8_t Data);
    void GPIO_WriteDataBit(GPIO_Port GPIO_x, uint8_t Bit_x, uint8_t BitValue);
    void GPIO_Init(GPIO_Port GPIO_x, uint8_t Bit_x, GPIO_InitTypeDef * GPIO_InitStruct);
    void GPIO_SetOutput(GPIO_Port GPIO_x, uint8_t Bit_x);
    void GPIO_SetInput(GPIO_Port GPIO_x, uint8_t Bit_x);
    void GPIO_SetInputEnableReg(GPIO_Port GPIO_x, uint8_t Bit_x, FunctionalState NewState);
    void GPIO_SetOutputEnableReg(GPIO_Port GPIO_x, uint8_t Bit_x, FunctionalState NewState);
    void GPIO_SetPullUp(GPIO_Port GPIO_x, uint8_t Bit_x, FunctionalState NewState);
    void GPIO_SetOpenDrain(GPIO_Port GPIO_x, uint8_t Bit_x, FunctionalState NewState);
    void GPIO_EnableFuncReg(GPIO_Port GPIO_x, uint8_t FuncReg_x, uint8_t Bit_x);
    void GPIO_DisableFuncReg(GPIO_Port GPIO_x, uint8_t FuncReg_x, uint8_t Bit_x);
/** @} */
/* End of group GPIO_Exported_FunctionPrototypes */
/** @} */
/* End of group GPIO */
/** @} */
/* End of group TX03_Periph_Driver */
#ifdef __cplusplus
}
#endif                          /* __cplusplus */
#endif                          /* __TMPM363_GPIO_H */
